Repository: AnatolyZimin/designate
Catalog: designate/locale/*/LC_MESSAGES/designate.po
Languages: fr

source: Policy check succeeded for rule '%(rule)s' on target %(target)s
fr: Vérification de stratégie réussie pour la règle '%(rule)s' pour la cible %(target)s

source: Policy check failed for rule '%(rule)s' on target %(target)s
fr: Vérification de stratégie ayant échoué pour la règle '%(rule)s' pour la cible %(target)s

source: Starting %(topic)s node (version %(version_string)s)
fr: Démarrage du noeud %(topic)s (version %(version_string)s)

source: Creating RPC server on topic '%s'
fr: Créer un serveur RPC pour topic '%s'

source: serve() can only be called once
fr: serve() ne peut être appelé qu'une seule fois

source: Unknown sort direction, must be 'desc' or 'asc'
fr: Direction d'ordonnancement inconnue, choisir 'desc' ou 'asc'

source: Could not read %s. Re-running with sudo
fr: Impossible de lire %s. Nouvelle exécution avec sudo

source: sudo failed, continuing as if nothing happened
fr: sudo a échoué, continue comme si de rien n'était

source: Please re-run designate-manage as root.
fr: Veuillez exécuter designate-manage à nouveau en tant que root

source: Unable to acquire lock on `%(filename)s` due to %(exception)s
fr: Impossible d'obtenir un verrou sur `%(filename)s` à cause de %(exception)s

source: Deprecated: %s
fr: Déprécié : %s

source: Error loading logging config %(log_config)s: %(err_msg)s
fr: Erreur de chargement de la config de journalisation %(log_config)s: %(err_msg)s

source: syslog facility must be one of: %s
fr: La fonction syslog doit faire partie de : %s

source: Fatal call to deprecated config: %(msg)s
fr: Appel fatal à config dépréciée : %(msg)s

source: The JSON file that defines policies.
fr: Le fichier JSON qui définit les stratégies.

source: Default rule. Enforced when a requested rule is not found.
fr: Règle par défaut. Respectée quand une règle demandée n'est pas trouvée.

source: The directories of policy configuration files is stored
fr: Les répertoires des fichiers de configuration sont stockés

source: Policy doesn't allow %s to be performed.
fr: Stratégie ne permettant pas d'effectuer %s.

source: Rules must be an instance of dict or Rules, got %s instead
fr: Les règles doivent représenter une instance de dict ou Règles, %s obtenu à la place

source: Unexpected error while running command.
fr: Erreur inattendue lors de l'exécution de la commande.

source: %(description)s Command: %(cmd)s Exit code: %(exit_code)s Stdout: %(stdout)r Stderr: %(stderr)r
fr: %(description)s Commande : %(cmd)s Code de sortie : %(exit_code)s Stdout : %(stdout)r Stderr : %(stderr)r

source: Got unknown keyword args: %r
fr: Args de mot clé inconnu : %r

source: Command requested root, but did not specify a root helper.
fr: La commande exigeait root, mais n'indiquait pas comment obtenir root.

source: Running cmd (subprocess): %s
fr: Exécute cmd (sousprocessus) : %s

source: %r failed. Retrying.
fr: %r a échoué. Nouvelle tentative.

source: Environment not supported over SSH
fr: Environnement non pris en charge avec SSH

source: process_input not supported over SSH
fr: process_input not non pris en charge avec SSH

source: Unable to find cert_file : %s
fr: Impossible de trouver le cert_file : %s

source: Unable to find ca_file : %s
fr: Impossible de trouver le ca_file : %s

source: Unable to find key_file : %s
fr: Impossible de trouver le key_file : %s

source: When running server in SSL mode, you must specify both a cert_file and key_file option value in your configuration file
fr: Quand vous exécutez un serveur en mode SSL, vous devez spécifier la valeur des l'options cert_file et key_file dans votre fichier de configuration

source: Invalid SSL version : %s
fr: Version SSL non valide : %s

source: %(what)s is deprecated as of %(as_of)s in favor of %(in_favor_of)s and may be removed in %(remove_in)s.
fr: %(what)s déprécié depuis %(as_of)s au bénéfice de %(in_favor_of)s et sera sans doute retiré dans %(remove_in)s.

source: %(what)s is deprecated as of %(as_of)s and may be removed in %(remove_in)s. It will not be superseded.
fr: %(what)s déprécié depuis %(as_of)s et sera sans doute retiré dans %(remove_in)s. Ne sera pas remplacé.

source: %(what)s is deprecated as of %(as_of)s in favor of %(in_favor_of)s.
fr: %(what)s déprécié depuis %(as_of)s au bénéfice de %(in_favor_of)s.

source: %(what)s is deprecated as of %(as_of)s. It will not be superseded.
fr: %(what)s déprécié depuis %(as_of)s. Ne sera pas remplacé.

source: Uncaught exception
fr: Exception non interceptée

source: Could not bind to %(host)s:%(port)s after trying for 30 seconds
fr: Impossible de se connecter au %(host)s:%(port)s après un effort d'une durée de 30 secondes

source: Unsupported Content-Type
fr: Type de contenu non pris en charge

source: Malformed request body
fr: Corps de texte de la requête malformé

source: Empty body provided in request
fr: Aucun contenu dans la requête

source: Unrecognized Content-Type provided in request
fr: Type de contenu fourni dans la requête non reconnu

source: No Content-Type provided in request
fr: Aucun Type de contenu fourni dans la requête

source: Unable to deserialize body as provided Content-Type
fr: Impossible de dé sérialiser le corps de contenu fourni par le Type de contenu

source: cannot understand JSON
fr: ne comprend pas JSON

source: cannot understand XML
fr: ne comprend pas XML
